tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "microsoft/mssql-release"
tap "rigellute/tap"
# Spell checker with better logic than ispell
brew "aspell"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Development kit for the Java programming language
brew "openjdk"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Vector graphics library with cross-device output support
brew "cairo"
# Implementation of malloc emphasizing fragmentation avoidance
brew "jemalloc"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Emacs dependency management
brew "cask"
# Free lossless audio codec
brew "flac"
# Blu-Ray disc playback library for media players like VLC
brew "libbluray"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Read, create, and modify MP4 files
brew "mp4v2"
# Music player with an ncurses based interface
brew "cmus"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Programming language for highly scalable real-time systems
brew "erlang"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Command-line tool to interact with exercism.io
brew "exercism"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Common error values for all GnuPG components
brew "libgpg-error"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg", link: false
# Open-source video transcoder available for Linux, Mac, and Windows
brew "handbrake"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Configurable static site generator
brew "hugo"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# LLVM's OpenMP runtime library
brew "libomp"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Manage your Java environment
brew "jenv"
# Implementation of the file(1) command
brew "libmagic"
# Extensible, open standard container format for audio/video
brew "libmatroska"
# Postgres C API library
brew "libpq"
# Library to render SVG files using Cairo
brew "librsvg"
# Library for processing keyboard entry from the terminal
brew "libtermkey"
# YAML Parser
brew "libyaml"
# Mac App Store command-line interface
brew "mas"
# Matroska media files manipulation tools
brew "mkvtoolnix"
# UNIX movie player
brew "mplayer"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Open client for Cisco AnyConnect VPN
brew "openconnect"
# Swiss-army knife of markup format conversion
brew "pandoc"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# PostgreSQL syntax beautifier
brew "pgformatter"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Spotify daemon
brew "spotifyd", restart_service: true
# Programmatically correct mistyped console commands
brew "thefuck"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# ODBC Driver for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/msodbcsql17"
# A terminal user interface for Spotify
brew "rigellute/tap/spotify-tui"
# Application launcher and productivity software
cask "alfred"
cask "amazon-chime"
# Data backup and storage service
cask "backblaze"
# Menu bar icon organizer
cask "bartender"
cask "betterzipql"
# Utility that prevents the system from going to sleep
cask "caffeine"
# Hard disk backup and cloning utility
cask "carbon-copy-cloner"
# Free universal database tool and SQL client
cask "dbeaver-community"
# Client for the Dropbox cloud storage service
cask "dropbox"
cask "fantastical"
# Web browser
cask "firefox"
cask "font-cascadia"
cask "font-fauna-one"
cask "font-fira-code"
cask "font-hack"
# Code font with monospaced ligatures
cask "font-hasklig"
cask "font-inter-ui"
# Typeface made for developers
cask "font-jetbrains-mono"
cask "font-lato"
cask "font-montserrat"
cask "font-open-sans"
cask "font-roboto"
cask "font-roboto-condensed"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
# Fonts designed for user interfaces
cask "font-source-sans-pro"
cask "forticlient"
# Web browser
cask "google-chrome"
# Tools to protect your emails and files
cask "gpg-suite"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Spots differences in text and image files
cask "kaleidoscope"
# Music services manager
cask "lastfm"
cask "livereload"
# QuickLook plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# QuickLook generator for Markdown files
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
# Music streaming service
cask "spotify"
# Tool for liberating data tables trapped inside PDF files
cask "tabula"
# Unpacks archive files
cask "the-unarchiver"
# Git client focusing on power and productivity
cask "tower"
# File transfer application
cask "transmit"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Open-source version of the X.Org X Window System
cask "xquartz"
mas "1Blocker", id: 1107421413
mas "Agenda", id: 1287445660
mas "Bear", id: 1091189122
mas "CARROT Weather", id: 993487541
mas "Craft", id: 1487937127
mas "DaisyDisk", id: 411643860
mas "Day One", id: 1055511498
mas "Deliveries", id: 924726344
mas "iA Writer", id: 775737590
mas "Kindle", id: 405399194
mas "Letter Opener", id: 411897373
mas "LG Screen Manager", id: 1142051783
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Moom", id: 419330170
mas "Pixelmator", id: 407963104
mas "Pixelmator Pro", id: 1289583905
mas "Reeder", id: 1529448980
mas "Sim Daltonism", id: 693112260
mas "Spark", id: 1176895641
mas "Tot", id: 1491071483
mas "Trello", id: 1278508951
mas "Twitter", id: 1482454543
mas "WiFi Explorer", id: 494803304
mas "Xcode", id: 497799835
